litr = int(input("Введіть витрату пального вашого авто: "))

if litr <= 0:
    print("В загалі не витрачає!?!?! У Вас електрична автівка?")
elif litr <= 3:
    print("Дуже економна автівка, у Вас мабудь гібридний двигун.")
elif litr <= 5:
    print("О це так!!! У вас дуже економічна автівка  :)  ")
elif litr <= 7:
    print("У вас не великий розхід палива  :)  ")
elif litr <= 9:
    print("Не погано! Витрата пального в нормі.")
elif litr <= 12:
    print("Трохи за багато в наш час, але кому як :)  ")
elif litr <= 19:
    print("За багато :( але мабуть в вашій автівці багато потужності  :)  ")
else:
    print("Ого! О це так їсть. Та не прокормити її!")